---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LinearConstraintBadDirection
source: html/51d53049-abbc-c35b-4851-a0359d198bc1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LinearConstraintBadDirection Property

Bad direction vector in dimension element.

## Syntax (C#)
```csharp
public static FailureDefinitionId LinearConstraintBadDirection { get; }
```